billing/fixtures/plans.json

[{"model": "billing.plan", "pk": "0ce9205d-bf18-4f43-ab7d-a4e01ef39fac", "fields": {"stripe_id": "standard", "created": "2017-12-22T12:14:25.544Z", "metadata": {"gb_hours": 180}, "livemode": false, "amount": 1800, "currency": "usd", "interval": "month", "interval_count": 1, "name": "Standard", "statement_descriptor": null, "trial_period_days": null}}, {"model": "billing.plan", "pk": "20b1c984-1ad7-4de3-96b1-de19a20dc73e", "fields": {"stripe_id": "starter", "created": "2017-12-22T12:13:54.984Z", "metadata": {"gb_hours": 90}, "livemode": false, "amount": 900, "currency": "usd", "interval": "month", "interval_count": 1, "name": "Starter", "statement_descriptor": null, "trial_period_days": null}}, {"model": "billing.plan", "pk": "d8d062a4-3205-468a-a027-86f8d7b12e3f", "fields": {"stripe_id": "professional", "created": "2017-12-22T12:15:39.048Z", "metadata": {"gb_hours": 500}, "livemode": false, "amount": 4900, "currency": "usd", "interval": "month", "interval_count": 1, "name": "Professional", "statement_descriptor": null, "trial_period_days": null}}, {"model": "billing.plan", "pk": "ea0935a4-c4c9-4c8c-8afc-5b83056e9647", "fields": {"stripe_id": "threeblades-free-plan", "created": "2017-12-22T12:13:01.191Z", "metadata": {"gb_hours": 10}, "livemode": false, "amount": 0, "currency": "usd", "interval": "month", "interval_count": 1, "name": "Threeblades Free Plan", "statement_descriptor": null, "trial_period_days": null}}]